# Используем официальный образ Go для сборки
FROM golang:1.23 AS builder

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем файлы go.mod и go.sum для установки зависимостей
COPY go.mod go.sum ./

# Устанавливаем зависимости
RUN go mod download

# Копируем весь проект
COPY . .

# Собираем приложение
RUN go build -o tasker ./cmd/tasker

# Используем минимальный образ Alpine для финального контейнера
FROM golang:1.23

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем собранное приложение из builder
COPY --from=builder /app/tasker .

# Копируем статические файлы фронтенда
COPY ./web ./web

# Копируем базу данных (если нужно)
COPY ./scheduler.db .

# Определяем переменную окружения для порта (по умолчанию 7540)
ENV TODO_PORT=7540

# Указываем порт, который будет использовать приложение
EXPOSE ${TODO_PORT}

# Команда для запуска приложения
CMD ["./tasker"]